/* No comment provided by engineer. */
"Abi" = "ABI";

/* No comment provided by engineer. */
"ABI copied" = "ABI已复制";

/* No comment provided by engineer. */
"ABI Interface" = "ABI接口";

/* About Controllers Title */
"About" = "关于";

/* Wallet Controllers Activity */
"Activity" = "活动";

/* No comment provided by engineer. */
"Address" = "地址";

/* No comment provided by engineer. */
"Address copied" = "地址已拷贝";

/* Choose Recive Address Controller Title
 Transaction detail button */
"Addresses" = "地址";

/* No comment provided by engineer. */
"Available Balance" = "可用余额";

/* BACK button */
"BACK" = "返回";

/* No comment provided by engineer. */
"Backup App Version" = "备份应用版本";

/* Backup Contracts Controllers Title */
"Backup Contracts" = "备份合约";

/* No comment provided by engineer. */
"Backup Date" = "备份日期";

/* No comment provided by engineer. */
"BlockHash" = "块哈希";

/* No comment provided by engineer. */
"BlockNumber" = "块高度";

/* No comment provided by engineer. */
"By changing address or currency, transaction will be processed as a regular transfer " = "改变了地址或币种后，交易会被处理成普通转移";

/* No comment provided by engineer. */
"CALL" = "调用";

/* No comment provided by engineer. */
"Camera premission not found" = "不允许访问摄像头";

/* No comment provided by engineer. */
"Cancel" = "取消";

/* Cancel Button
 Cancel button
 Import Wallet CANCEL Button */
"CANCEL" = "取消";

/* No comment provided by engineer. */
"Cannot create transaction" = "无法创建交易";

/* Contracts Change Name Controllers button */
"CHANGE" = "更改";

/* Contracts Change Name Controllers Title */
"Change contract name" = "更改合约名称";

/* No comment provided by engineer. */
"Change PIN" = "更改PIN码";

/* No comment provided by engineer. */
"CHOOSE ANOTHER ADDRESS" = "选择另一个地址";

/* No comment provided by engineer. */
"CHOOSE FROM LIBRARY" = "从库中选择";

/* Choose Token Controllers Title */
"Choose Token" = "选择Token";

/* No comment provided by engineer. */
"CLOSE" = "关闭";

/* No comment provided by engineer. */
"Compiled On:" = "编译于:";

/* Confirm Passphrase Controllers Title */
"Confirm Passphrase" = "确认助记词";

/* Confirm PIN Controllers Title
 Confirm PIN Popoup Title */
"Confirm PIN" = "确认PIN";

/* No comment provided by engineer. */
"Confirm Purchase" = "确认支付";

/* No comment provided by engineer. */
"Confirm Transaction" = "确认交易";

/* No comment provided by engineer. */
"Confirmed" = "确认";

/* CONTINUE Button */
"CONTINUE" = "继续";

/* No comment provided by engineer. */
"Continue" = "继续";

/* No comment provided by engineer. */
"Contract Address" = "合约地址";

/* No comment provided by engineer. */
"Contract bought" = "合约已购买";

/* No comment provided by engineer. */
"Contract Created" = "合约已创建";

/* No comment provided by engineer. */
"Contract created successfully" = "合约成功创建";

/* Contract name placeholder */
"Contract name" = "合约名称";

/* No comment provided by engineer. */
"Contract Name:" = "合约名称:";

/* No comment provided by engineer. */
"Contract Type:" = "合约类型:";

/* No comment provided by engineer. */
"Contract was added to your wallet" = "合约已添加到钱包";

/* No Contract Text */
"Contract was deleted by its author and is no longer available. You can Unsubscribe to remove it from your wallet." = "合约已被作者删除并已不再可用。你可以选择取消订阅以从钱包中删除。";

/* No comment provided by engineer. */
"Contract with same address already exists" = "已存在相同地址的合约";

/* No comment provided by engineer. */
"ContractAddress" = "合约地址";

/* Contracts Controllers Title */
"Contracts" = "合约";

/* No comment provided by engineer. */
"Contracts Store" = "合约商店";

/* No comment provided by engineer. */
"Copied" = "已复制";

/* No comment provided by engineer. */
"Copy" = "复制";

/* Copy Button */
"COPY" = "复制";

/* COPY ABI button */
"COPY ABI" = "复制ABI";

/* COPY ADDRESS button */
"COPY ADDRESS" = "复制地址";

/* COPY PASSPHRASE button */
"COPY PASSPHRASE" = "复制助记词";

/* Copy Passphrase Controllers Title */
"Copy Passphrase" = "复制助记词";

/* No comment provided by engineer. */
"Copy the passphrase to restore your wallet on another device" = "复制助记词以在另一台设备上恢复钱包";

/* No comment provided by engineer. */
"Copy to Share" = "复制以分享";

/* No comment provided by engineer. */
"COPY WALLET ADDRESS" = "复制钱包地址";

/* No comment provided by engineer. */
"Create a wallet or restore a previous wallet key." = "创建钱包或从以前的钱包恢复。";

/* CREATE NEW Button */
"CREATE NEW" = "创建";

/* Create PIN Controllers Title */
"Create PIN" = "创建PIN";

/* No comment provided by engineer. */
"Crowdsale" = "众筹";

/* No comment provided by engineer. */
"Cumulative Gas Used" = "累计已用Gas";

/* No comment provided by engineer. */
"Data" = "数据";

/* No comment provided by engineer. */
"Decimal Units" = "单位";

/* No comment provided by engineer. */
"Decimal Units:" = "单位:";

/* No comment provided by engineer. */
"Description:" = "描述:";

/* No comment provided by engineer. */
"Done" = "完成";

/* No comment provided by engineer. */
"Downloads:" = "下载:";

/* No comment provided by engineer. */
"EDIT" = "编辑";

/* Edite button */
"EDITE" = "编辑";

/* ENABLE TOUCH ID Button */
"ENABLE TOUCH ID" = "启用TOUCH ID";

/* No comment provided by engineer. */
"Enter New PIN" = "输入新的PIN码";

/* No comment provided by engineer. */
"Enter Old PIN" = "输入旧的PIN码";

/* No comment provided by engineer. */
"Error" = "错误";

/* No comment provided by engineer. */
"Error in QRCodeCreation" = "创建二维码失败";

/* Transaction detail button */
"Event Logs" = "事件日志";

/* Export Passphrase Controllers Title */
"Export Passphrase" = "导出助记词";

/* No comment provided by engineer. */
"Failed" = "失败";

/* No comment provided by engineer. */
"Failed to create contract" = "创建合约失败";

/* Fee text */
"Fee" = "手续费";

/* No comment provided by engineer. */
"Fee:" = "手续费:";

/* few seconds ago */
"few seconds ago" = "几秒前";

/* No comment provided by engineer. */
"File saved successfully" = "成功保存文件";

/* No comment provided by engineer. */
"From" = "从";

/* Function Detail Controllers Title */
"Function Detail" = "函数详情";

/* Functions Controller Title
 Functions Controllers Title */
"Functions" = "函数";

/* No comment provided by engineer. */
"Gas Limit:" = "Gas限制:";

/* No comment provided by engineer. */
"Gas Price:" = "Gas价格:";

/* No comment provided by engineer. */
"GasUsed" = "已用Gas";

/* No comment provided by engineer. */
"Hex" = "代码";

/* Import Wallet IMPORT Button */
"IMPORT" = "导入";

/* Resore Button */
"IMPORT WALLET" = "导入钱包";

/* Import Wallet Controllers Title */
"Import Wallet" = "导入钱包";

/* No comment provided by engineer. */
"Incorrect address" = "地址不正确";

/* No comment provided by engineer. */
"Initial Supply" = "初始发行量";

/* No comment provided by engineer. */
"Initial Supply:" = "初始发行量:";

/* No comment provided by engineer. */
"Internal\ntransaction" = "内部交易";

/* No comment provided by engineer. */
"Invalid Contract Address" = "非法的合约地址";

/* No comment provided by engineer. */
"Invalid Contract Name" = "非法的合约名字";

/* No comment provided by engineer. */
"Invalid QR Code format" = "无效的二维码格式";

/* No comment provided by engineer. */
"Invalid TRIPI Address" = "不合法的TRIPI地址";

/* No comment provided by engineer. */
"Invalid Token Address" = "非法的Token地址";

/* No comment provided by engineer. */
"It's my tokens" = "这是我的tokens";

/* Language Controllers Title */
"Language" = "语言";

/* No comment provided by engineer. */
"Last Added" = "最近添加";

/* Library Controllers Title */
"Library" = "库";

/* No comment provided by engineer. */
"Log Out" = "登出";

/* No comment provided by engineer. */
"Login" = "登录";

/* LOGIN Button */
"LOGIN" = "登录";

/* No comment provided by engineer. */
"Login to TRIPI \nDon't have a wallet yet?" = "登录到TRIPI\n还没有钱包？";

/* No comment provided by engineer. */
"Login to TRIPI \nusing Touch ID" = "登录到TRIPI\n使用Touch ID";

/* No comment provided by engineer. */
"Logout" = "登出";

/* Manage Addresses Controllers Title
 Token Manage Addresses Controllers Title */
"Manage Addresses" = "管理地址";

/* No comment provided by engineer. */
"Miner Address:" = "矿工地址:";

/* time ago */
"minut ago" = "分钟前";

/* time ago */
"minuts ago" = "分钟前";

/* No comment provided by engineer. */
"My address: %@ and amount: %.3f" = "我的地址: %@ 及数量: %2$.3f";

/* No comment provided by engineer. */
"My Contract Templates" = "我的合约模板";

/* No comment provided by engineer. */
"My Published Contracts" = "我发布的合约";

/* Wallet Controllers Title */
"My Wallet" = "我的钱包";

/* No comment provided by engineer. */
"Name" = "名称";

/* News Controllers Title
 Tabs */
"News" = "资讯";

/* News Detail Controllers Title */
"News Details" = "资讯详情";

/* No comment provided by engineer. */
"Next" = "下一步";

/* No comment provided by engineer. */
"NEXT" = "下一步";

/* No comment provided by engineer. */
"NO" = "否";

/* No comment provided by engineer. */
"No Internet Connection" = "没有网络连接";

/* No comment provided by engineer. */
"No Internet connection found" = "未找到网络连接";

/* Empty Tokens Tabel */
"No Tokens Found" = "未找到Token";

/* No comment provided by engineer. */
"No transactions available yet" = "尚无交易";

/* NOT NOW Button */
"NOT NOW" = "以后再说";

/* Confirm Passphrase note text */
"Note that you won’t be able to restore  your wallet without Passphrase and all funds can be lost." = "注意你无法在没有助记词的情况下恢复你的钱包，所有的资金都会丢失";

/* No comment provided by engineer. */
"Number" = "数量";

/* Ok button */
"OK" = "确定";

/* No comment provided by engineer. */
"Ok" = "确定";

/* No comment provided by engineer. */
"Oops" = "糟糕";

/* Other Tokens Controllers Title */
"Other Tokens" = "其他Token";

/* Transaction detail button */
"Overview" = "概览";

/* No comment provided by engineer. */
"Parameter" = "参数";

/* No comment provided by engineer. */
"Passphrase copied" = "助记词已拷贝";

/* No comment provided by engineer. */
"Payment completed successfully" = "成功完成支付";

/* No comment provided by engineer. */
"Payment Request" = "支付请求";

/* No comment provided by engineer. */
"PIN is invalid. Please Try Again." = "PIN无效，请重试";

/* No comment provided by engineer. */
"Please check your network\nsettings" = "请检查网络设置";

/* Confirm Passphrase title label */
"Please put the words from passphrase into correct order:" = "请按正确顺序输入助记词:";

/* No comment provided by engineer. */
"Please wait" = "请稍候";

/* No comment provided by engineer. */
"Price:" = "价格:";

/* No comment provided by engineer. */
"Private key" = "私钥";

/* Profile Controllers Title
 Tabs */
"Profile" = "概述";

/* No comment provided by engineer. */
"Public Key" = "公钥";

/* No comment provided by engineer. */
"Publish Date" = "发布日期";

/* No comment provided by engineer. */
"Published by:" = "发布人:";

/* No comment provided by engineer. */
"Published Date:" = "发布日期:";

/* PURCHASE Button */
"PURCHASE" = "支付";

/* QR Code Controller Title */
"QR Code" = "二维码";

/* Qstore Controller Title */
"Qstore" = "Q商店";

/* TRIPI sybmol */
"TRIPI" = "TRIPI";

/* No comment provided by engineer. */
"TRIPI (Default)" = "TRIPI(默认)";

/* No comment provided by engineer. */
"TRIPI Address" = "TRIPI地址";

/* No comment provided by engineer. */
"TRIPI App will only upload\nand share photos you choose." = "TRIPI应用只会上传您选择的照片。";

/* No comment provided by engineer. */
"TRIPI App would like to access your photos" = "TRIPI App想要访问您的照片库";

/* No comment provided by engineer. */
"TRIPI App Would Like\nto Access Your Photos" = "TRIPI App想要访问您的照片库";

/* No comment provided by engineer. */
"TRIPI Mobile Wallet" = "TRIPI移动钱包";

/* Receive Controllers Title */
"Receive" = "接收";

/* No comment provided by engineer. */
"Received" = "已接收";

/* No comment provided by engineer. */
"Received Time" = "接收时间";

/* No comment provided by engineer. */
"Repeat New PIN" = "再次输入新的PIN码";

/* Repeate PIN Controllers Title */
"Repeat PIN" = "重复PIN";

/* No comment provided by engineer. */
"Requested Token not found" = "未找到Token";

/* Confirm Passphrase RESET ALL button */
"RESET ALL" = "全部重置";

/* RESTORE button */
"RESTORE" = "恢复";

/* No comment provided by engineer. */
"Restore All" = "恢复所有";

/* Restore Contracts Controllers Title */
"Restore Contracts" = "恢复合约";

/* No comment provided by engineer. */
"Restore Templates" = "恢复模板";

/* No comment provided by engineer. */
"Restore Tokens" = "恢复Token";

/* No comment provided by engineer. */
"Restored successfully" = "恢复成功";

/* Search placeholder */
"Search" = "查找";

/* No comment provided by engineer. */
"Select backup file" = "选择备份文件";

/* Send Controllers Title
 Tabs */
"Send" = "发送";

/* Send button */
"SEND" = "发送";

/* No comment provided by engineer. */
"Send to contract" = "发送到合约";

/* No comment provided by engineer. */
"Sent" = "已发送";

/* No comment provided by engineer. */
"Sent Time" = "发送时间";

/* No comment provided by engineer. */
"Sent\ncontract" = "已发送合约";

/* No comment provided by engineer. */
"Size:" = "大小:";

/* Smart Contract Parameters Contollers Title */
"Smart Contract Parameters" = "智能合约参数";

/* Smart Contracts Controllers Title */
"Smart Contracts" = "智能合约";

/* No comment provided by engineer. */
"Some Error" = "错误";

/* No comment provided by engineer. */
"Something went wrong" = "出现错误";

/* No comment provided by engineer. */
"Sorry, Please try again in %li minutes" = "对不起，请在%li分钟后重试";

/* Unsupported token message */
"Sorry, this token exceeds the limit of 128 decimals. So it can not be supported in TRIPI app" = "对不起，这个token超过了128位，它不能被TRIPI app支持。";

/* SOURCE Code Button */
"SOURCE" = "源";

/* No comment provided by engineer. */
"Source Code" = "源代码";

/* No comment provided by engineer. */
"Source Code:" = "源代码:";

/* No comment provided by engineer. */
"Step 1 of 2" = "第1步，共2步";

/* No comment provided by engineer. */
"Step 2 of 2" = "第2步，共2步";

/* No comment provided by engineer. */
"Switch Application Theme" = "切换应用主题";

/* No comment provided by engineer. */
"Tags:" = "标签:";

/* No comment provided by engineer. */
"Tap to save the file" = "轻触以保存文件";

/* Templates Controllers Title */
"Templates" = "模板";

/* No comment provided by engineer. */
"Text" = "文本";

/* Confirm Passphrase error text */
"The passphrase is not correct. Please click \"Reset all\" to clear the field and try again" = "助记词不正确。请点击\"全部重置\" 来清除并重试";

/* No comment provided by engineer. */
"To" = "到";

/* No comment provided by engineer. */
"Token" = "Token";

/* No comment provided by engineer. */
"Token Address" = "Token地址";

/* No comment provided by engineer. */
"Token Created" = "Token已创建";

/* No comment provided by engineer. */
"Token Details" = "Token详情";

/* Token Subscriptions Controllers Title */
"Token Subscriptions" = "Token认购";

/* No comment provided by engineer. */
"Token was added to your wallet" = "Token已添加到您的钱包";

/* No comment provided by engineer. */
"Token with same address already exists" = "已存在相同地址的Token";

/* No comment provided by engineer. */
"Tokens" = "Tokens";

/* No comment provided by engineer. */
"Topics" = "主题";

/* Touch ID Controllers Title */
"Touch ID" = "Touch ID";

/* Controllers Title */
"Transaction" = "交易";

/* No comment provided by engineer. */
"Transaction amount can't be zero. Please edit your transaction and try again" = "交易金额不能为零。请编辑后重试";

/* TRANSFER button */
"TRANSFER" = "转移";

/* No comment provided by engineer. */
"Transfer" = "转移";

/* No comment provided by engineer. */
"Transfer Balance" = "转移余额";

/* No comment provided by engineer. */
"Trending Now" = "时下流行";

/* No comment provided by engineer. */
"TRY AGAIN" = "重试";

/* No comment provided by engineer. */
"TxHash" = "交易哈希";

/* No comment provided by engineer. */
"Type" = "类型";

/* No comment provided by engineer. */
"Unconfirmed" = "未确认";

/* No comment provided by engineer. */
"Unconfirmed Balance" = "未确认余额";

/* Unconfirmed Transaction Label */
"Unconfirmed Transaction" = "未确认交易";

/* No comment provided by engineer. */
"Unconfirmed Yet..." = "还未确认...";

/* Token Cell Light Unconfirmed Balance */
"Unconfirmed:" = "未确认:";

/* UNSUBSCRIBE Button */
"UNSUBSCRIBE" = "取消订阅";

/* Unsupported token text */
"Unsupported" = "暂不支持";

/* View Abi Button */
"View Abi" = "查看ABI";

/* View Details Button */
"View Details" = "查看详情";

/* Tabs */
"Wallet" = "钱包";

/* No comment provided by engineer. */
"Wallet Backup" = "钱包备份";

/* No comment provided by engineer. */
"Warning" = "警告";

/* Watch Contract Controllers Title */
"Watch Contract" = "关注合约";

/* Watch Token Controllers Title */
"Watch Token" = "关注Token";

/* Watch Token Controllers Title */
"Watch Token111" = "关注Token111";

/* Qstore Cell */
"What’s New" = "更新";

/* No comment provided by engineer. */
"YES" = "是";

/* day at history cell */
"Yesterday" = "昨天";

/* No comment provided by engineer. */
"You are about to exit your account. All account data will be erased from the device. Please make sure you have saved back-ups of your Passphrase and required Contracts" = "您即将退出您的账户。所有账户数据都会被从这台设备上删除。请确认您已经备份了助记词及需要的合约";

/* Skip Skip Info */
"You can skip this step and export your passphrase at any time" = "您可以跳过这步，并在任何时候导出您的助记词";

/* No comment provided by engineer. */
"You don’t have a wallet yet." = "您还没有钱包";

/* No comment provided by engineer. */
"You have insufficient funds for this transaction" = "Y资金不足无法发起交易";

/* No comment provided by engineer. */
"You have insufficient funds for this transaction at this address" = "您这个地址没有足够的余额";

/* No comment provided by engineer. */
"You haven't tokens for share" = "您没有可分享的tokens";

/* No comment provided by engineer. */
"Your balance was last updated at" = "您的余额最后更新于";

/* No comment provided by engineer. */
"Your balance was updated" = "您的余额已更新";

/* No comment provided by engineer. */
"Your Passphrase" = "您的助记词";

/* No comment provided by engineer. */
"Сonnection to selected file was timed out. Please select backup file again" = "到已选择的文件的连接已超时，请重新选择备份文件";

/* No comment provided by engineer. */
"Token Name" = "Token名称";

/* No comment provided by engineer. */
"FINISH" = "完成";

/* No comment provided by engineer. */
"Confirm" = "确认";

